# PathStart Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathOfTravel..::..PathStart Property
PathOfTravel Class See Also
---
The start point of the path. The Z coordinate will equal the view's level elevation. To update path calculations, call update.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public XYZ PathStart { get; set; }
```

Visual Basic
---
```text
Public Property PathStart As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ PathStart {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: This functionality is not available in Revit LT. -or- When setting this property: Cannot perform this operation for a path of travel in a group. |

# See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace